###################################################################

# Created by write_sdc on Wed Feb 10 23:27:53 2016

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[7]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[6]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[5]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[4]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[3]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[2]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_op[0]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_rnd_mode[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_rnd_mode[0]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_id[4]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_id[3]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_id[2]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_id[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_id[0]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_fcc[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_fcc[0]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[63]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[62]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[61]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[60]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[59]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[58]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[57]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[56]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[55]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[54]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[53]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[52]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[51]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[50]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[49]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[48]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[47]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[46]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[45]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[44]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[43]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[42]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[41]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[40]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[39]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[38]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[37]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[36]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[35]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[34]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[33]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[32]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[31]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[30]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[29]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[28]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[27]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[26]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[25]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[24]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[23]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[22]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[21]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[20]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[19]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[18]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[17]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[16]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[15]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[14]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[13]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[12]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[11]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[10]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[9]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[8]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[7]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[6]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[5]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[4]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[3]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[2]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in1[0]}]
set_driving_cell -lib_cell in01f80 [get_ports inq_in1_50_0_neq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in1_53_32_neq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in1_exp_eq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in1_exp_neq_ffs]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[63]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[62]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[61]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[60]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[59]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[58]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[57]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[56]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[55]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[54]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[53]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[52]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[51]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[50]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[49]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[48]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[47]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[46]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[45]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[44]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[43]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[42]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[41]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[40]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[39]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[38]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[37]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[36]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[35]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[34]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[33]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[32]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[31]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[30]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[29]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[28]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[27]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[26]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[25]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[24]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[23]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[22]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[21]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[20]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[19]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[18]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[17]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[16]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[15]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[14]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[13]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[12]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[11]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[10]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[9]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[8]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[7]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[6]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[5]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[4]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[3]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[2]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[1]}]
set_driving_cell -lib_cell in01f80 [get_ports {inq_in2[0]}]
set_driving_cell -lib_cell in01f80 [get_ports inq_in2_50_0_neq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in2_53_32_neq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in2_exp_eq_0]
set_driving_cell -lib_cell in01f80 [get_ports inq_in2_exp_neq_ffs]
set_driving_cell -lib_cell in01f80 [get_ports inq_add]
set_driving_cell -lib_cell in01f80 [get_ports add_dest_rdy]
set_driving_cell -lib_cell in01f80 [get_ports fadd_clken_l]
set_driving_cell -lib_cell in01f80 [get_ports arst_l]
set_driving_cell -lib_cell in01f80 [get_ports grst_l]
set_driving_cell -lib_cell in01f80 [get_ports SEL]
set_driving_cell -lib_cell in01f80 [get_ports se_add_exp]
set_driving_cell -lib_cell in01f80 [get_ports se_add_frac]
set_driving_cell -lib_cell in01f80 [get_ports si]
set_load -pin_load 4 [get_ports add_pipe_active]
set_load -pin_load 4 [get_ports a1stg_step]
set_load -pin_load 4 [get_ports a6stg_fadd_in]
set_load -pin_load 4 [get_ports {add_id_out_in[9]}]
set_load -pin_load 4 [get_ports {add_id_out_in[8]}]
set_load -pin_load 4 [get_ports {add_id_out_in[7]}]
set_load -pin_load 4 [get_ports {add_id_out_in[6]}]
set_load -pin_load 4 [get_ports {add_id_out_in[5]}]
set_load -pin_load 4 [get_ports {add_id_out_in[4]}]
set_load -pin_load 4 [get_ports {add_id_out_in[3]}]
set_load -pin_load 4 [get_ports {add_id_out_in[2]}]
set_load -pin_load 4 [get_ports {add_id_out_in[1]}]
set_load -pin_load 4 [get_ports {add_id_out_in[0]}]
set_load -pin_load 4 [get_ports a6stg_fcmpop]
set_load -pin_load 4 [get_ports {add_exc_out[4]}]
set_load -pin_load 4 [get_ports {add_exc_out[3]}]
set_load -pin_load 4 [get_ports {add_exc_out[2]}]
set_load -pin_load 4 [get_ports {add_exc_out[1]}]
set_load -pin_load 4 [get_ports {add_exc_out[0]}]
set_load -pin_load 4 [get_ports a6stg_dbl_dst]
set_load -pin_load 4 [get_ports a6stg_sng_dst]
set_load -pin_load 4 [get_ports a6stg_long_dst]
set_load -pin_load 4 [get_ports a6stg_int_dst]
set_load -pin_load 4 [get_ports add_sign_out]
set_load -pin_load 4 [get_ports {add_exp_out[10]}]
set_load -pin_load 4 [get_ports {add_exp_out[9]}]
set_load -pin_load 4 [get_ports {add_exp_out[8]}]
set_load -pin_load 4 [get_ports {add_exp_out[7]}]
set_load -pin_load 4 [get_ports {add_exp_out[6]}]
set_load -pin_load 4 [get_ports {add_exp_out[5]}]
set_load -pin_load 4 [get_ports {add_exp_out[4]}]
set_load -pin_load 4 [get_ports {add_exp_out[3]}]
set_load -pin_load 4 [get_ports {add_exp_out[2]}]
set_load -pin_load 4 [get_ports {add_exp_out[1]}]
set_load -pin_load 4 [get_ports {add_exp_out[0]}]
set_load -pin_load 4 [get_ports {add_frac_out[63]}]
set_load -pin_load 4 [get_ports {add_frac_out[62]}]
set_load -pin_load 4 [get_ports {add_frac_out[61]}]
set_load -pin_load 4 [get_ports {add_frac_out[60]}]
set_load -pin_load 4 [get_ports {add_frac_out[59]}]
set_load -pin_load 4 [get_ports {add_frac_out[58]}]
set_load -pin_load 4 [get_ports {add_frac_out[57]}]
set_load -pin_load 4 [get_ports {add_frac_out[56]}]
set_load -pin_load 4 [get_ports {add_frac_out[55]}]
set_load -pin_load 4 [get_ports {add_frac_out[54]}]
set_load -pin_load 4 [get_ports {add_frac_out[53]}]
set_load -pin_load 4 [get_ports {add_frac_out[52]}]
set_load -pin_load 4 [get_ports {add_frac_out[51]}]
set_load -pin_load 4 [get_ports {add_frac_out[50]}]
set_load -pin_load 4 [get_ports {add_frac_out[49]}]
set_load -pin_load 4 [get_ports {add_frac_out[48]}]
set_load -pin_load 4 [get_ports {add_frac_out[47]}]
set_load -pin_load 4 [get_ports {add_frac_out[46]}]
set_load -pin_load 4 [get_ports {add_frac_out[45]}]
set_load -pin_load 4 [get_ports {add_frac_out[44]}]
set_load -pin_load 4 [get_ports {add_frac_out[43]}]
set_load -pin_load 4 [get_ports {add_frac_out[42]}]
set_load -pin_load 4 [get_ports {add_frac_out[41]}]
set_load -pin_load 4 [get_ports {add_frac_out[40]}]
set_load -pin_load 4 [get_ports {add_frac_out[39]}]
set_load -pin_load 4 [get_ports {add_frac_out[38]}]
set_load -pin_load 4 [get_ports {add_frac_out[37]}]
set_load -pin_load 4 [get_ports {add_frac_out[36]}]
set_load -pin_load 4 [get_ports {add_frac_out[35]}]
set_load -pin_load 4 [get_ports {add_frac_out[34]}]
set_load -pin_load 4 [get_ports {add_frac_out[33]}]
set_load -pin_load 4 [get_ports {add_frac_out[32]}]
set_load -pin_load 4 [get_ports {add_frac_out[31]}]
set_load -pin_load 4 [get_ports {add_frac_out[30]}]
set_load -pin_load 4 [get_ports {add_frac_out[29]}]
set_load -pin_load 4 [get_ports {add_frac_out[28]}]
set_load -pin_load 4 [get_ports {add_frac_out[27]}]
set_load -pin_load 4 [get_ports {add_frac_out[26]}]
set_load -pin_load 4 [get_ports {add_frac_out[25]}]
set_load -pin_load 4 [get_ports {add_frac_out[24]}]
set_load -pin_load 4 [get_ports {add_frac_out[23]}]
set_load -pin_load 4 [get_ports {add_frac_out[22]}]
set_load -pin_load 4 [get_ports {add_frac_out[21]}]
set_load -pin_load 4 [get_ports {add_frac_out[20]}]
set_load -pin_load 4 [get_ports {add_frac_out[19]}]
set_load -pin_load 4 [get_ports {add_frac_out[18]}]
set_load -pin_load 4 [get_ports {add_frac_out[17]}]
set_load -pin_load 4 [get_ports {add_frac_out[16]}]
set_load -pin_load 4 [get_ports {add_frac_out[15]}]
set_load -pin_load 4 [get_ports {add_frac_out[14]}]
set_load -pin_load 4 [get_ports {add_frac_out[13]}]
set_load -pin_load 4 [get_ports {add_frac_out[12]}]
set_load -pin_load 4 [get_ports {add_frac_out[11]}]
set_load -pin_load 4 [get_ports {add_frac_out[10]}]
set_load -pin_load 4 [get_ports {add_frac_out[9]}]
set_load -pin_load 4 [get_ports {add_frac_out[8]}]
set_load -pin_load 4 [get_ports {add_frac_out[7]}]
set_load -pin_load 4 [get_ports {add_frac_out[6]}]
set_load -pin_load 4 [get_ports {add_frac_out[5]}]
set_load -pin_load 4 [get_ports {add_frac_out[4]}]
set_load -pin_load 4 [get_ports {add_frac_out[3]}]
set_load -pin_load 4 [get_ports {add_frac_out[2]}]
set_load -pin_load 4 [get_ports {add_frac_out[1]}]
set_load -pin_load 4 [get_ports {add_frac_out[0]}]
set_load -pin_load 4 [get_ports {add_cc_out[1]}]
set_load -pin_load 4 [get_ports {add_cc_out[0]}]
set_load -pin_load 4 [get_ports {add_fcc_out[1]}]
set_load -pin_load 4 [get_ports {add_fcc_out[0]}]
set_load -pin_load 4 [get_ports so]
create_clock [get_ports clk]  -period 750  -waveform {0 375}
